Repository: AutoContCZ/AC-NAV-TranslationMemory
Catalog: TM_Helps_Final_Version.tmx
Source language: en_us
Languages: cs_cz

source: The Automatically Fill Date Received field in the Payment Registration window
cs_cz: Pole Automaticky vyplnit datum přijetí v okně Registrace plateb

source: The Payment Registration window shows outstanding incoming payments as lines that represent sales documents where an amount is due for payment.
cs_cz: Okno Registrace plateb zobrazuje neuhrazené příchozí platby jako řádky, které představují prodejní doklady, u nichž je částka splatná.

source: For more information about applying customer payments, see How to:
cs_cz: Další informace o použití zákaznických plateb naleznete v Návod:

source: Reconcile Customer Payments Manually From a List of Unpaid Sales Documents .
cs_cz: Ruční odsouhlasení zákaznických plateb ze seznamu neuhrazených prodejních dokladů .

source: You main actions in the window are to fill in the Payment Made check box and the Date Received field.
cs_cz: Vaší hlavní akcí je zaškrtnout v okně políčko Platba provedena a vyplnit pole Datum přijetí.

source: You can set Dynamics NAV up to automatically enter work date in the Date Received field when you select the Payment Made check box.
cs_cz: Váš Dynamics NAV můžete nastavit tak, aby když zaškrtnete políčko Platba, automaticky vložil pracovní datum do pole Datum přijetí.

source: To have the Date Received field in the Payment Registration window filled automatically
cs_cz: Automatické vyplnění pole Datum přijetí v okně Registrace plateb

source: Select the Automatically Fill Date Received check box.
cs_cz: Zaškrtněte políčko Automaticky vyplnit datum přijetí.

source: Open the Payment Registration window and proceed to process incoming customer payments using the described functionality for automatic entry of a field value.
cs_cz: Otevřete okno Registrace plateb a pokračujte v procesu zpracování příchozích plateb zákazníků pomocí popsané funkce pro automatické zadání hodnoty pole.

source: A report layout controls content and format of the report, including which data fields of a report dataset appear on the report and how they are arranged, text style, images, and more.
cs_cz: Rozvržení sestavy řídí obsah a formát sestavy, včetně toho, která datová pole datové sady sestavy se objeví v sestavě a jak budou uspořádány, včetně stylu textu, obrázků a dalších.

source: From the Dynamics NAV clients, you can change which layout is used on a report, create new layout, or modify the existing layouts.
cs_cz: Z klientů Dynamics NAV můžete změnit, které rozvržení se použije na sestavu, vytvořit nové rozvržení nebo modifikovat existující rozvržení.

source: In particular, a report layout sets up the following:
cs_cz: Sady rozvržení zejména nastavují následující:

source: The label and data fields to include from the dataset of the Dynamics NAV report.
cs_cz: Popisky a datová pole, která mají být zahrnuta z datové sady sestavy Dynamics NAV.

source: The text format, such as font type, size, and color.
cs_cz: Formát textu, například typ písma, velikost a barva.

source: The company logo and its position.
cs_cz: Logo společnosti a její postavení.

source: General page settings, such as margins and background images.
cs_cz: Nastavení obecné stránky, jako například okraje a obrázky na pozadí.

source: A Dynamics NAV can be set up with multiple report layouts, which you can switch among as required.
cs_cz: Dynamics NAV lze nastavit s více rozvrženími sestavy, mezi kterými můžete podle potřeby přepínat.

source: You can use one of the built-in report layouts or you can create custom report layouts and assign them to your reports as needed.
cs_cz: Můžete použít jedno z vestavěných rozvržení sestavy, nebo můžete vytvořit vlastní rozvržení sestavy a podle potřeby je přiřadit k sestavám.

source: There are two types of report layouts that you can use on reports:
cs_cz: Existují dva typy rozvržení sestavy, které můžete použít v sestavách:

source: Word and RDLC.
cs_cz: Aplikace Word a RDLC.

source: Word report layout overview
cs_cz: Přehled rozvržení sestavy aplikace Word

source: A Word report layout is a based on Word document (.docx file type).
cs_cz: Rozvržení sestavy aplikace Word je založeno na dokumentu aplikace Word (typ souboru .docx).

source: Word report layouts enable you to design report layouts by using Microsoft Word 2013 or later.
cs_cz: Rozvržení sestavy aplikace Word umožňují navrhnout rozvržení sestavy pomocí aplikace Microsoft Word 2013 nebo novější.

source: A Word report layout determines the report's content - controlling how that content elements are arranged and how they look.
cs_cz: Rozvržení sestavy aplikace Word určuje obsah sestavy - kontroluje, jak jsou uspořádány a jak vypadají prvky obsahu.

source: A Word report layout document will typically use tables to arrange content, where the cells can contain data fields, text, or pictures.
cs_cz: Dokument rozvržení sestavy aplikace Word obvykle používá tabulky k uspořádání obsahu, kde mohou buňky obsahovat datová pole, text nebo obrázky.

source: RDLC layout overview
cs_cz: Přehled rozvržení RDLC

source: RDLC layouts are based on client report definition layouts (.rdlc or .rdl file types).
cs_cz: Rozvržení RDLC jsou založeny na rozvržení definice sestavy klienta (typy souborů typu .rdlc nebo .rdl).

source: These layouts are created and modified by using SQL Server Report Builder.
cs_cz: Tato rozvržení jsou vytvořena a upravena pomocí nástroje Microsoft SQL Server – Tvůrce sestav.

source: The design concept for RDLC layouts is similar to Word layouts, where the layout defines the general format of the report and determines the fields from the dataset to include.
cs_cz: Koncept návrhu rozvržení RDLC je podobný jako rozvržení aplikace Word, kde rozvržení definuje obecný formát sestavy a určuje pole z datové sady.

source: Designing RDLC layouts is more advanced than Word layouts.
cs_cz: Návrh rozvržení RDLC je mnohem pokročilejší než rozvržení aplikace Word.

source: Built-in and custom report layouts
cs_cz: Vestavěné a vlastní rozvržení sestavy

source: Dynamics NAV includes several built-in layouts.
cs_cz: Dynamics NAV obsahuje několik vestavěných rozvržení.

source: Built-in layouts are predefined layouts that are designed for specific reports.
cs_cz: Vestavěné rozvržení jsou předdefinované rozvržení, které jsou určeny pro konkrétní sestavy.

source: Dynamics NAV reports will have a built-in layout as either an RDLC report layout, Word report layout, or in some cases both.
cs_cz: Sestavy Dynamics NAV budou mít vestavěnou sestavu jako rozvržení sestavy RDLC, rozvržení sestavy aplikace Word nebo v některých případech i v obou.

source: You cannot modify a built-in report layout from Dynamics NAV but you use them as a starting point for building your own custom report layouts.
cs_cz: V aplikaci Dynamics NAV nelze vestavěné rozvržení upravovat, ale používáte jej jako výchozí bod pro vytváření vlastních rozvržení sestav.

source: Custom layouts are report layouts that you design to change the appearance of a report.
cs_cz: Vlastní rozvržení jsou rozvržení sestavy, které navrhujete, abyste změnili vzhled sestavy.

source: You typically create a custom layout based on a built-in layout, but you can create them from scratch or from a copy of an existing custom layout.
cs_cz: Obvykle vytvoříte vlastní rozvržení založené na vestavěném rozvržení, ale můžete je vytvořit od začátku nebo z kopie existujícího vlastního rozvržení.

source: Custom layouts enable you to have multiple layouts for the same report, which you switch among as needed.
cs_cz: Vlastní rozvržení umožňují vytvořit více rozvržení pro stejnou sestavu, mezi kterými můžete podle potřeby přepínat.

source: For example, you can have different layouts for each Dynamics NAV company, or you can have different layouts for the same company for specific occasions or events, like a special campaign or holiday season.
cs_cz: Například můžete mít různé rozvržení pro každou společnost Dynamics NAV, nebo můžete mít různé rozvržení pro stejnou společnost pro určité příležitosti nebo události, jako je speciální kampaň nebo prázdninová sezóna.

source: Deciding whether to use a Word or RDLC report layout
cs_cz: Rozhodování, zda použít rozvržení sestavy aplikace Word nebo RDLC

source: A report layout can be based on either a Word document or RDLC file.
cs_cz: Rozvržení sestavy může být založeno buď na dokumentu aplikace Word nebo souboru RDLC.

source: Deciding on whether to use a Word report layout or RDLC report layout type will depend on how you want the generated report to look and your knowledge of Word and SQL Server Report Builder.
cs_cz: Rozhodování, zda chcete použít rozvržení sestavy aplikace Word nebo rozvržení sestavy RDLC, bude záviset na tom, jak chcete, aby vygenerovaná sestava vypadala a na znalostech o aplikacích Word a Microsoft SQL Server – Tvůrce sestav.

source: The general design concepts for Word and RDLC layouts are very similar.
cs_cz: Obecné koncepty návrhu pro rozvržení aplikace Word a RDLC jsou velmi podobné.

source: However each type has certain design features that affect how the generated report is appears in Dynamics NAV.
cs_cz: Každý typ má však určité funkce návrhu, které ovlivňují, jak se vygenerovaná sestava zobrazuje v Dynamics NAV.

source: This means that the same report might look different when using the Word report layout compared to the RDLC report layout.
cs_cz: To znamená, že stejný přehled může vypadat jinak, pokud používáte rozvržení sestavy aplikace Word oproti rozvržení sestavy RDLC.

source: The process for setting up Word report layouts and RDLC report layouts on reports is the same.
cs_cz: Proces nastavení rozvržení sestavy aplikace Word a RDLC v sestavách je stejný.

source: The main difference is in the way you modify the layouts.
cs_cz: Hlavní rozdíl je v tom, jak upravujete rozvržení.

source: Word report layouts are typically easier to create and modify than RDLC report layouts because you can use Word.
cs_cz: Rozvržení sestav aplikace Word jsou obvykle jednodušší k vytvoření a úpravám než rozvržení sestav RDLC, protože můžete použít aplikaci Word.

source: RDLC report layouts are modified by using SQL Server Report builder which targets more advanced users.
cs_cz: Rozvržení sestavy RDLC se upravuje pomocí nástroje SQL Server – Tvůrce sestav, který je určen pro pokročilejší uživatele.

source: For information on how to change which layout to use, see How to:
cs_cz: Pro více informací o tom, jak změnit rozvržení, které chcete použít, viz Návod:

source: Mandatory Fields
cs_cz: Povinná pole

source: When you enter data on pages in Dynamics NAV, certain fields are marked with a red asterisk.
cs_cz: Při zadávání dat na stránkách Dynamics NAV jsou některá pole označena červenou hvězdičkou.

source: The red asterisk means that the field must be filled to complete a certain process that uses the field, such as posting a transaction that uses the value in the field.
cs_cz: Červená hvězdička znamená, že pole musí být vyplněno, aby se dokončil určitý proces, který dané pole používá, například zaúčtování transakce, která používá hodnotu v poli.

source: Even though the field contains a red asterisk, you are not forced to fill in the field before you continue to other fields or close the page.
cs_cz: I když pole obsahuje červenou hvězdičku, není nutné vyplnit pole před tím, než budete pokračovat k dalším polím nebo zavřete stránku.

source: The red asterisk only serves as a reminder that you will be blocked from completing a certain process.
cs_cz: Červená hvězdička slouží pouze jako upozornění, že dokončení určitého procesu bude zablokováno.

source: Examples
cs_cz: Příklady:

source: In the Customer Card window, the red asterisk appears in the Name field, in the Tax Area Code field, and in the posting group fields to indicate that you cannot post a sales transaction for the customer unless the fields are filled.
cs_cz: V okně Karta zákazníka se červená hvězdička objevuje v poli Název, v poli Kód daňové oblasti a v polích účto skupiny a označuje, že nemůžete pro zákazníka zaúčtovat prodejní transakci, pokud nejsou pole vyplněna.

source: In the Item Card window, the red asterisk appears in the Description field to indicate that you cannot enter the item on a document line, such as a sales order, unless this field is filled.
cs_cz: V okně Karta zboží se červená hvězdička objevuje v poli Popis k označení, že nemůžete zadat zboží na řádek dokladu, jako například na prodejní objednávku, pokud není pole vyplněno.

source: Posting represents the accounting action of recording business transactions in the various company ledgers.
cs_cz: Účtování představuje účetní akci při zaznamenávání obchodních transakcí v různých firemních denících.

source: Practically every document and journal in Dynamics NAV offers a Posting group from which you can choose between different posting actions, such as Post, Preview Posting, Post and Send, Post and Email.
cs_cz: Prakticky každý doklad a deník v Dynamics NAV nabízí Účtování ze které můžete vybírat mezi různými účtovacími akcemi, jako je akce Účtovat, Náhled účtování, Účtovat a odeslat, Účtovat a odeslat e-mailem.

source: The following table describes related tasks, with links to the topics that describe them.
cs_cz: Následující tabulka popisuje související úlohy s odkazy na témata, které je popisují.

source: Learn about posting purchase documents.
cs_cz: Informace o účtování nákupních dokladů.

source: Posting Purchases
cs_cz: Účtování nákupů

source: Learn about posting sales documents.
cs_cz: Informace o účtování prodejních dokladů.

source: Posting Sales
cs_cz: Účtování prodeje

source: Learn about posting general journals.
cs_cz: Informace o účtování finančních deníků.

source: Preview, in a window, the entries that will be created when you post.
cs_cz: Náhled v okně položky, které budou vytvořeny po odeslání.

source: Preview, in a report, the entries that will be created when you post.
cs_cz: Náhled, v sestavě, položky které budou vytvořeny když účtujete.

source: In the Posting group on a purchase document, you can choose between the following posting functions:
cs_cz: Ve skupině Účtování na nákupním dokladu si můžete vybrat mezi následujícími funkcemi:

source: Post
cs_cz: Účtovat

source: Preview Posting
cs_cz: Náhled účtování

source: Post and Print
cs_cz: Účtovat a vytisknout

source: Test Report
cs_cz: Testovací sestava

source: Post Batch
cs_cz: Dávkové účtování

source: When you have completed all the lines and entered all the information on the purchase order, you can post it, that is, create a receipt and an invoice.
cs_cz: Po dokončení všech řádků a zadání všech informací na objednávce ji můžete zaúčtovat, to znamená vytvoření příjemky a faktury.

source: When a purchase order is posted, the vendor's account, the general ledger, and the item ledger entries are updated.
cs_cz: Po zaúčtování nákupní objednávky se aktualizují účty dodavatele, hlavní knihy a položky zboží.

source: For each purchase order, a purchase entry is created in the G/L Entry table.
cs_cz: Pro každou nákupní objednávku je vytvořena nákupní položka v tabulce Věcných položek.

source: An entry is also created in the vendor's account in the Vendor Ledger Entry table and a G/L entry is created in the relevant payables account.
cs_cz: Položka je také vytvořena pro účet dodavatele v tabulce Položka dodavatele a věcná položka je vytvořena na příslušném účtu závazků.

source: In addition, posting the order may result in a VAT entry and a G/L entry for the discount amount.
cs_cz: Kromě toho může zaúčtování objednávky vést k vytvoření položky DPH a věcné položky pro částku slevy.

source: Whether an entry for the discount is posted depends on the contents of the Discount Posting field in the Purchases & Payables Setup window.
cs_cz: Zda je položka pro slevu zaúčtována, závisí na obsahu pole Účtování slevy v okně Nastavení nákupu a závazků.

source: For each purchase order line, an item ledger entry will be created in the Item Ledger Entry table (if the purchase lines contain item numbers) or a G/L entry will be created in the G/L Entry table (if the purchase lines contain a G/L account).
cs_cz: Pro každý řádek nákupní objednávky bude vytvořena položka zboží v tabulce Položky zboží (pokud budou řádky nákupu obsahovat čísla zboží) nebo bude vytvořena věcná položka v tabulce Věcných položek (pokud budou řádky nákupu obsahovat finanční účet).

source: In addition, purchase orders are always recorded in the Purch.
cs_cz: Kromě toho jsou nákupní objednávky vždy zaznamenávány v tabulkách Hlavička nákupní příjemky a

source: Header and Purch.
cs_cz: Hlavička nákupní faktury .

source: Before you start to post, you can print a test report that contains all the information in the purchase order and indicates any errors there.
cs_cz: Než začnete účtovat, můžete vytisknout testovací sestavu, která obsahuje všechny informace z nákupní objednávky a označuje případné chyby.

source: To print the report, choose Posting, and then choose Test Report.
cs_cz: Chcete-li sestavu vytisknout, zvolte možnost Účtovat a poté zvolte Testovací sestava.

source: When you post an order, you can create both a receipt and an invoice.
cs_cz: Když zaúčtujete objednávku, můžete vytvořit jak příjemku, tak fakturu.

source: These can be done simultaneously or independently.
cs_cz: To může být provedeno současně nebo nezávisle.

source: You can also create a partial receipt and a partial invoice by completing the Qty. to Receive and Qty. to Invoice fields on the individual purchase order lines before you post.
cs_cz: Můžete také vytvořit částečnou příjemku a částečnou fakturu tím, že předtím než zaúčtujete, vyplníte pole Množ. k příjmu a Množ. k fakturaci na jednotlivých řádcích nákupní objednávky.

source: Note that you cannot create an invoice for something that has not been received.
cs_cz: Všimněte si, že nemůžete vytvořit fakturu za něco, co nebylo přijato.

source: That is, before you can invoice, you must have recorded a receipt, or you must choose to receive and invoice at the same time.
cs_cz: To znamená, že předtím, než budete moci fakturovat, musíte mít zaznamenanou příjemku, nebo musíte vybrat přijmout a fakturovat současně.

source: You can either post, or post and print.
cs_cz: Můžete buď účtovat, nebo účtovat a tisknout.

source: If you choose to post and print, a report is printed when the order is posted.
cs_cz: Pokud zvolíte účtovat a tisknout, pak se sestava vytiskne v okamžiku, kdy je objednávka účtována.

source: You can also choose the Post Batch function, which lets you post several orders at the same time.
cs_cz: Můžete také zvolit funkci Dávkové účtování, která umožňuje účtovat více objednávek najednou.

source: When the posting is completed, the posted purchase lines are removed from the order.
cs_cz: Když je účtování kompletní, zaúčtované nákupní řádky jsou z objednávky odebrány.

source: A message tells you when the posting is completed.
cs_cz: Jakmile je účtování dokončeno je zobrazena zpráva.

source: After this, you will be able to see the posted entries in the various windows that contain posted entries, such as the Vendor Ledger Entries, G/L Entries, Item Ledger Entries, Purchase Receipts, and Posted Purchase Invoices windows.
cs_cz: Poté budete moci v různých oknech zobrazit zaúčtované položky jako jsou Položky dodavatele, Věcné položky, Položky zboží, Nákupní příjemky a Zaúčtované nákupní faktury.

source: In the Posting group on a sales document, you can choose between the following posting functions:
cs_cz: Ve skupině Účtování na prodejním dokladu si můžete vybrat mezi následujícími účtovacími funkcemi:

source: Post and Send
cs_cz: Účtovat a odeslat

source: Post and Email
cs_cz: Účtovat a poslat e-mailem

source: When you have completed all the lines and entered all the information on the sales order, you can post it.
cs_cz: Po dokončení všech řádků a zadání všech informací na objednávce ji můžete zaúčtovat.

source: This creates a shipment and an invoice.
cs_cz: Tím vytvoříte dodávku a fakturu.

source: When a sales order is posted, the customer's account, the general ledger, and the item ledger entries are updated.
cs_cz: Po zaúčtování prodejní objednávky se aktualizují účty zákazníka, hlavní knihy a položky zboží.

source: For each sales order, a sales entry is created in the G/L Entry table.
cs_cz: Pro každou prodejní objednávku je v tabulce Věcných položek vytvořena položka prodeje.

source: An entry is also created in the customer's account in the Cust.
cs_cz: Položka je také vytvořena na účtu zákazníka v Položkách zákazníka

source: Ledger Entry table and a general ledger entry is created in the relevant receivables account.
cs_cz: Na příslušném účtu pohledávek je vytvořena tabulka Položek hlavní knihy a položka hlavní knihy.

source: In addition, posting the order may result in a VAT entry and a general ledger entry for the discount amount.
cs_cz: Kromě toho, může zaúčtování objednávky vést k položce DPH a položce hlavní knihy pro částku slevy.

source: Whether an entry for the discount is posted depends on the contents of the Discount Posting field in the Sales & Receivables Setup window.
cs_cz: Zda je položka pro slevu zaúčtována, závisí na obsahu pole Účtování slevy v okně Nastavení Prodeje a Pohledávek.

source: For each sales order line, an item ledger entry will be created in the Item Ledger Entry table (if the sales lines contain item numbers) or a general ledger entry will be created in the G/L Entry table (if the sales lines contain a general ledger account).
cs_cz: Pro každý řádek prodejní objednávky bude vytvořena položka zboží v tabulce Položky zboží (pokud budou řádky prodeje obsahovat čísla zboží) nebo bude vytvořena položka hlavní knihy v tabulce Věcných položek (pokud budou řádky prodeje obsahovat finanční účet).

source: In addition to this, sales orders are always recorded in the Sales Shipment Header and Sales Invoice Header tables.
cs_cz: Kromě toho jsou prodejní objednávky vždy zaznamenávány v tabulkách Hlavička prodejní dodávky a Hlavička prodejních faktur.

source: When you post an order, you can create both a shipment and an invoice.
cs_cz: Když zaúčtujete objednávku, můžete vytvořit jak dodávku, tak fakturu.

source: These can be done at the same time or independently.
cs_cz: To může být provedeno současně nebo nezávisle.

source: You can also create a partial shipment and a partial invoice by completing the Qty. to Ship and Qty. to Invoice fields on the individual sales order lines before you post.
cs_cz: Můžete také vytvořit částečnou dodávku a částečnou fakturu tím, že předtím než účtujete, vyplníte pole Množ. k dodání a Množ. k fakturaci na jednotlivých řádcích prodejní objednávky.

source: Note that you cannot create an invoice for something that is not shipped.
cs_cz: Všimněte si, že nemůžete vytvořit fakturu za něco, co není dodáno.

source: That is, before you can invoice, you must have recorded a shipment, or you must choose to ship and invoice at the same time.
cs_cz: To znamená, že předtím, než budete moci fakturovat, musíte mít zaznamenanou dodávku, nebo musíte vybrat dodat a fakturovat současně.

source: When the posting is completed, the posted sales lines are removed from the order.
cs_cz: Když je účtování kompletní, zaúčtované prodejná řádky jsou z objednávky odebrány.

source: After this, you will be able to see the posted entries in the various windows that contain posted entries, such as the Cust.
cs_cz: Poté budete moci zobrazit zaúčtované položky v různých oknech, které obsahují zaúčtované položky, jako například okna

source: Ledger Entries , G/L Entries, Item Ledger Entries, Posted Sales Shipments, and Posted Sales Invoices windows.
cs_cz: Položky zákazníka, Věcné položky, Položky zboží, Zaúčtování prodejních dodávek a Zaúčtování prodejních faktur.
